app/views/wants/index.html.slim

SELECT `wants`.* FROM `wants`
---
          handler.callback = function(){
            google.maps.event.addListener(handler.map.serviceObject, "click", function(e){
              var form = '<form class="new_wants" id="new_wants" action="/wants" accept-charset="UTF-8" method="post"><input name="utf8" type="hidden" value="&#x2713;" /><input type="hidden" name="authenticity_token" value="'+token+'" /><div class="field"><input type="hidden" name="wants[USER_ID]" value="'+#{if current_user then current_user.id}+'"  id="wants_USER_ID" /></div><div class="field"><label for="wants_TITLE">Title</label><input type="text" name="wants[TITLE]" id="wants_TITLE" />が欲しい！</div><div class="field"><label for="wants_CATEGORY_ID">Category name</label><select id="categories_id" name="wants[CATEGORY_ID]" id="wants_CATEGORY_ID" />i<option value="1">飲食関係</option><option value="2">ファッション</option><option value="3">エンタメ</option><option value="4">公共施設</option><option value="5">交通関係</option></select></div><div class="field"><label for="wants_COMMENT">Comment</label><textarea name="wants[COMMENT]" id="wants_COMMENT"></textarea></div><div class="field"><input type="hidden" name="wants[LATITUDE]" value="'+e.latLng.lat()+'"  id="wants_LATITUDE" /></div><div class="field"><input type="hidden" name="wants[LONGITUDE]" value="'+e.latLng.lng()+'"  id="wants_LONGITUDE" /></div><div class="actions"><input type="submit" name="commit" value="Create Wants" data-disable-with="Create Wants" /></div></form>';
              markers = handler.addMarkers([
                {
                  "lat": e.latLng.lat(),
                  "lng": e.latLng.lng(),
                  "infowindow": form,
                }
              ]);
            });