app/controllers/wants_controller.rb

SELECT `wants`.* FROM `wants`
---
  def index
    if session[:last]
      @last = session[:last]
    end
    @wants = Wants.all